       IDENTIFICATION DIVISION.
        PROGRAM-ID. reverse-string.
       DATA DIVISION.
        WORKING-STORAGE SECTION.
        01 WS-STRING PIC X(64).
        01 I PIC 99.
        01 WS-REVERSE-STRING-INDEX PIC 99.
        01 WS-TEMP PIC X.
       PROCEDURE DIVISION.
        REVERSE-STRING.
          MOVE FUNCTION LENGTH(FUNCTION TRIM(WS-STRING)) TO WS-REVERSE-STRING-INDEX
          PERFORM VARYING I FROM 1 BY 1 UNTIL I > WS-REVERSE-STRING-INDEX
          MOVE WS-STRING(WS-REVERSE-STRING-INDEX:1) TO WS-TEMP
          MOVE WS-STRING(I:1) TO WS-STRING(WS-REVERSE-STRING-INDEX:1)
          MOVE WS-TEMP TO WS-STRING(I:1)
          SUBTRACT 1 FROM WS-REVERSE-STRING-INDEX
       END-PERFORM.